# 2.4 pandas and SQL Server  

- [Basics of Retrieving Data From SQL Server](#Basics-of-Retrieving-Data-From-SQL-Server)  
  a. Build connection object  
  b. Build the SQL String  
  c. Execute the SQL query and fill Dataframe with retrieved data  
  
  
- [Displaying All the Tables in a SQL Server Database](#Displaying-all-the-Tables-in-a-SQL-Server-Database)  

- [Displaying all the Views in a SQL Server Database](#Displaying-all-the-Views-in-a-SQL-Server-Database)

### Install Required:   *pip install pyodbc*

In [1]:
import pandas as pd
import pyodbc

### Credentials for Connecting to the demo SQL Server Database  
In a recent DataCamp article, I ran across a Public SQL Server we could use for this Notebook: "SQL with Tableau" (https://www.datacamp.com/community/tutorials/sql-tableau)

Credentials to the public SQL Server Database running on AWS:  
- Server Name:  **ec2-52-14-205-70.us-east-2.compute.amazonaws.com**  
- Database Name:  **SuperStoreUS**
- User Name:  **SQL**  
- Password:  **SQL**

# Basics of Retrieving Data From SQL Server  
a. Build connection object  
  b. Build the SQL String  
  c. Execute the SQL query and fill Dataframe with retrieved data

### a. Build Connection Object

In [2]:
# Set connection values to variables
driver = "DRIVER={SQL Server Native Client 11.0};" 
server = "Server= ec2-52-14-205-70.us-east-2.compute.amazonaws.com;" 
database = "Database=SuperStoreUS;" 
userid =   "uid=SQL;" 
password = "pwd=SQL;"
      
# Build connection string   
conn_string = driver + server + database + userid + password

# Create Connection object
conn = pyodbc.connect(conn_string)

### b. Build the SQL String

In [3]:
# Build the test demo SQL string:  retrieve all the records from the Orders table
sql_string = 'SELECT * FROM Orders'

###  c. Execute the SQL query and fill a Dataframe with retrieved data

In [4]:
# Execute SQL query and retrieve data into a dataframe
df = pd.read_sql_query(sql_string, conn)
df.head(2)

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
0,1160.0,CA-2018-147039,2018-06-29,2018-07-04,Standard Class,AA-10315,Alex Avila,Consumer,United States,Minneapolis,...,55407.0,Central,OFF-AP-10000576,Office Supplies,Appliances,"Belkin 325VA UPS Surge Protector, 6'",362.94,3,0.0,90.74
1,1161.0,CA-2018-147039,2018-06-29,2018-07-04,Standard Class,AA-10315,Alex Avila,Consumer,United States,Minneapolis,...,55407.0,Central,OFF-BI-10004654,Office Supplies,Binders,Avery Binding System Hidden Tab Executive Styl...,11.54,2,0.0,5.77

In [5]:
df.columns

Index(['Row ID', 'Order ID', 'Order Date', 'Ship Date', 'Ship Mode',
       'Customer ID', 'Customer Name', 'Segment', 'Country', 'City', 'State',
       'Postal Code', 'Region', 'Product ID', 'Category', 'Sub-Category',
       'Product Name', 'Sales', 'Quantity', 'Discount', 'Profit'],
      dtype='object')

# Displaying all the *Tables* in a SQL Server Database  
- Note: Reuse the connection object you created above

In [6]:
# Build SQL String to Display only the Tables
#sql_string = "select * from INFORMATION_SCHEMA.TABLES WHERE TABLE_TYPE='BASE TABLE'"
sql_string = "select * from INFORMATION_SCHEMA.TABLES"

# Execute the query and display all the rows in the dataframe that holds the retrieved data
df_Tables = pd.read_sql_query(sql_string, conn)
df_Tables

   TABLE_CATALOG TABLE_SCHEMA              TABLE_NAME  TABLE_TYPE
0   SuperstoreUS          dbo              Dictionary  BASE TABLE
1   SuperstoreUS          dbo  Orders with Dictionary  BASE TABLE
2   SuperstoreUS          dbo                Decimals  BASE TABLE
3   SuperstoreUS          dbo               Customers  BASE TABLE
4   SuperstoreUS          dbo                  People  BASE TABLE
5   SuperstoreUS          dbo          PeopleMultiple  BASE TABLE
6   SuperstoreUS          dbo                  Colors  BASE TABLE
7   SuperstoreUS          dbo                  Shapes  BASE TABLE
8   SuperstoreUS          dbo                 Returns  BASE TABLE
9   SuperstoreUS          dbo                 Charts1  BASE TABLE
10  SuperstoreUS          dbo                 Charts2  BASE TABLE
11  SuperstoreUS          dbo          Orders_Central  BASE TABLE
12  SuperstoreUS          dbo             Orders_East  BASE TABLE
13  SuperstoreUS          dbo                  Orders  BASE TABLE
14  SuperstoreUS          dbo            Orders_South  BASE TABLE
15  SuperstoreUS          dbo             Orders_West  BASE TABLE
16  SuperstoreUS          dbo                DateTime  BASE TABLE

# Displaying all the *Views* in a SQL Server Database  
- Note: Reuse the connection object you created above

In [8]:
# Build SQL String to Display only the Views
sql_string = "select * from INFORMATION_SCHEMA.VIEWS"

# Execute the query and display all the rows in the dataframe that holds the retrieved data
df_Views = pd.read_sql_query(sql_string, conn)
df_Views

Empty DataFrame
Columns: [TABLE_CATALOG, TABLE_SCHEMA, TABLE_NAME, VIEW_DEFINITION, CHECK_OPTION, IS_UPDATABLE]
Index: []